name: "bls_orchestrator"
backend: "python"
max_batch_size: 0

input [
  {
    name: "query"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ] 
  }
]

output [
  {
    name: "response"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]